const Mock = require('mockjs');

let data = Mock.mock({
  "courses|1143": [{
    "id|+1": 1,
    "title": "@ctitle(9,30)",
    "subon": "2019-04-09 10:13:21",
    "author": "@cname",
    "college": "东南大学",
    "img": "http://dummyimage.com/183x160",
    "bgimg": "http://dummyimage.com/320x278",
    "press": "清华出版社",
    "price|30-200": 30,
    "textbook": "<p>眼回何直圆必格几定议到个军江北县。此问们把族引华华给由者里龙外。划效线工年整制知共外华制明片影你金其。电称十结及完都系目新后看中无史。达界张共大交天示重方张切文。省积近西真商重不积力方节存。质受省但农还约我快江复市件流。团长山圆领斯圆就建条对包具。</p><p>眼回何直圆必格几定议到个军江北县。此问们把族引华华给由者里龙外。划效线工年整制知共外华制明片影你金其。电称十结及完都系目新后看中无史。达界张共大交天示重方张切文。省积近西真商重不积力方节存。质受省但农还约我快江复市件流。团长山圆领斯圆就建条对包具。</p><p>眼回何直圆必格几定议到个军江北县。此问们把族引华华给由者里龙外。划效线工年整制知共外华制明片影你金其。电称十结及完都系目新后看中无史。达界张共大交天示重方张切文。省积近西真商重不积力方节存。质受省但农还约我快江复市件流。团长山圆领斯圆就建条对包具。</p>",
    "aboutauthor": "<p>韩少功，1953年出生于湖南长沙，祖籍湖南澧县 [1]  。著名作家。</p><p>曾获境内外奖项：1980年、1981年全国优秀短篇小说奖；2002年法国文化部颁发的“法兰西文艺骑士奖章”；2007年第五届华语文学传媒大奖之“杰出作家奖”；第四届鲁迅文学奖；美国第二届纽曼华语文学奖等。作品分别以十多种外国文字共三十多种在境外出版。另有译作《生命中不能承受之轻》（昆德拉著）、《惶然录》（佩索阿著）等数种出版</p>",
    "studycount|90-300": 200,
    "studytime": "2019.2.13-2019.12.30",
    "invitecode": "00293099",
    "catalog": "<p>第一课时</p><p>第一课时</p><p>第一课时</p><p>第一课时</p><p>第一课时</p>",
    "isHot": true,
    "isrecommend": false,
    "catId|6-17": 8,
    "simimg": "http://dummyimage.com/185x160",
    "teacherId": 3
  }],
  "materials|2300": [{
    "id|+1": 1,
    "catId|6-17": 8,
    "title": "@ctitle(8,32)",
    "imgUrl":"@image('300','#a0495d', '#FFF', 'aicoder.com')",
    "author": "@cname",
    "price|10-100": 30,
    "deadline": "@date('yyyy-MM-dd HH:mm:ss')",
    "press": "清华出版社",
    "relevant_material": [{
      "id|51-100": 2,
      "title": "@ctitle(3,30)",
      "ISBN": "830000000002"
    }, {
      "id|1-50": 2,
      "title": "@ctitle(3,30)",
      "ISBN": "830000000002"
    }],
    "courseware_set": {
      "id|1-20": 9,
      "name": "@ctitle(3,30)",
      "count|10-100": 33
    },
    "question_bank": {
      "exercises|10-1000": 30,
      "examination_paper|1-300": 20,
      "name": "@ctitle(4, 20)"
    },
    "ISBN": "1000003200230",
    "description":"<p>眼回何直圆必格几定议到个军江北县。此问们把族引华华给由者里龙外。划效线工年整制知共外华制明片影你金其。电称十结及完都系目新后看中无史。达界张共大交天示重方张切文。省积近西真商重不积力方节存。质受省但农还约我快江复市件流。团长山圆领斯圆就建条对包具。</p><p>眼回何直圆必格几定议到个军江北县。此问</p>",
    "author_des": "<p>何直圆必格几定议到个军江北县。此问们把族引华华给何直圆必格几定议到个军江北县。此问们把族引华华给</p><p>何直圆必格几定议到个军江北县。此问们把族引华华给何直圆必格几定议到个军江北县。此问们把族引华华给</p><p>何直圆必格几定议到个军江北县。此问们把族引华华给何直圆必格几定议到个军江北县。此问们把族引华华给</p>",
    "cat_des": "<p>课程一： 是否连接历史角度发垃圾</p><p>课程一： 是否连接历史角度发垃圾</p><p>课程一： 是否连接历史角度发垃圾</p><p>课程一： 是否连接历史角度发垃圾</p>",
    "isHot|1": true,
    "count|20-500": 300
  }]
});

// console.log(JSON.stringify(data));
module.exports = data;
